@extends('front.layouts.master')
<!--//******************************************************************************************************** \\
////////////////////////////////////////// TITLE/////////////////////////////////////////////////// \\
//******************************************************************************************************** \\-->
@section('title')
    profile
@endsection
<!--//******************************************************************************************************** \\
////////////////////////////////////////// style/////////////////////////////////////////////////// \\
//******************************************************************************************************** \\-->
@section('style')
    <link rel="stylesheet" type="text/css" href="{{URL('assets/front/css/pages-style.css')}}"/>
@endsection
<!--//******************************************************************************************************** \\
////////////////////////////////////////// scripts/////////////////////////////////////////////////// \\
//******************************************************************************************************** \\-->
@section('scripts')
    <script src="{{URL('assets/front/js/custom.js')}}"></script>
@endsection
<!--//******************************************************************************************************** \\
////////////////////////////////////////// slider/////////////////////////////////////////////////// \\
//******************************************************************************************************** \\-->
@section('slider')
@endsection
<!--//******************************************************************************************************** \\
////////////////////////////////////////// content/////////////////////////////////////////////////// \\
//******************************************************************************************************** \\-->

@section('content')
    <div class="container">
        <div class="page-title">
            <a href=""><span class="fa fa-home"></span></a> > <i>حسـابى</i>

        </div>
    </div>

    <div class="container">

        @if(auth()->check())
            <?php $id = Auth::user()->id; ?>

            <div class="row">
                <div class="profile">

                    @include('front.profile.sidebar')

                    <div class="col-lg-9 prof-sid-con">
                        <div class="row">
                            <div class="col-md-12" id="docan_manag">
                                <h2> اداره الدكان </h2>
                                <div class="row">
                                    <ul class="col-md-3 list-unstyled">
                                        <h4> اداره المنتجات </h4>
                                        <li><a href="{{ url('profile/add-product/'.$shop_id)}}"> اضافه منتج </a></li>
                                        <li><a href="{{ url('profile/my-products/'.$shop_id)}}"> اداره المنتجات </a></li>
                                    </ul>
                                    <ul class="col-md-3 list-unstyled">
                                        <h4> اداره المبيعات </h4>
                                        <li><a href=""> عرض الطلبات </a></li>
                                        <li><a href=""> المرتجعات </a></li>
                                    </ul>
                                    <ul class="col-md-3 list-unstyled">
                                        <h4> التقارير </h4>
                                        <li><a href=""> تقارير المنتجات </a></li>
                                        <li><a href=""> تقارير الدكان </a></li>
                                    </ul>
                                    <ul class="col-md-3 list-unstyled">
                                        <h4> التقارير </h4>
                                        <li><a href=""> تقارير المنتجات </a></li>
                                        <li><a href=""> تقارير الدكان </a></li>
                                    </ul>
                                </div>
                            </div>
                            <div class="clearfix"></div>
                            <hr/>
                            <div class="col-md-12">

                            </div>



                            {{--i don't know what is this :D --}}
                       
                        </div>
                    </div>
                </div>
                @endif
            </div>
@endsection